In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/ADMIN/Downloads/datasets/russia/russia-real-estate-dataset.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11358150 entries, 0 to 11358149
Data columns (total 1 columns):
date;price;level;levels;rooms;area;kitchen_area;geo_lat;geo_lon;building_type;object_type;postal_code;street_id;id_region;house_id    object
dtypes: object(1)
memory usage: 86.7+ MB

In [19]:
columns = df.columns[0].split(';')

In [10]:
len(df.columns.str.split(';')[0])

15

In [8]:
series = df.squeeze().str.split(';', expand=True)

In [4]:
df.squeeze()[0]

0    2021-01-01;2451300;15;31;1;30.3;0;56.7801124;6...
1    2021-01-01;1450000;5;5;1;33;6;44.6081542;40.13...
2    2021-01-01;10700000;4;13;3;85;12;55.5400601;37...
3    2021-01-01;3100000;3;5;3;82;9;44.6081542;40.13...
4    2021-01-01;2500000;2;3;1;30;9;44.7386846;37.71...
Name: date;price;level;levels;rooms;area;kitchen_area;geo_lat;geo_lon;building_type;object_type;postal_code;street_id;id_region;house_id, dtype: object

In [9]:
series.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,2021-01-01,2451300,15,31,1,30.3,0,56.7801124,60.6993548,0,2,620000,,66,1632918
1,2021-01-01,1450000,5,5,1,33,6,44.6081542,40.1383814,0,0,385000,,1,
2,2021-01-01,10700000,4,13,3,85,12,55.5400601,37.7251124,3,0,142701,242543,50,681306
3,2021-01-01,3100000,3,5,3,82,9,44.6081542,40.1383814,0,0,385000,,1,
4,2021-01-01,2500000,2,3,1,30,9,44.7386846,37.7136681,3,2,353960,439378,23,1730985

In [24]:
series.columns = columns

In [25]:
series.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id
0,2021-01-01,2451300,15,31,1,30.3,0,56.7801124,60.6993548,0,2,620000,,66,1632918
1,2021-01-01,1450000,5,5,1,33,6,44.6081542,40.1383814,0,0,385000,,1,
2,2021-01-01,10700000,4,13,3,85,12,55.5400601,37.7251124,3,0,142701,242543,50,681306
3,2021-01-01,3100000,3,5,3,82,9,44.6081542,40.1383814,0,0,385000,,1,
4,2021-01-01,2500000,2,3,1,30,9,44.7386846,37.7136681,3,2,353960,439378,23,1730985

In [27]:
print(series.shape)
print(series.info())

(11358150, 15)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11358150 entries, 0 to 11358149
Data columns (total 15 columns):
date             object
price            object
level            object
levels           object
rooms            object
area             object
kitchen_area     object
geo_lat          object
geo_lon          object
building_type    object
object_type      object
postal_code      object
street_id        object
id_region        object
house_id         object
dtypes: object(15)
memory usage: 1.3+ GB
None

In [3]:
%%bash
pwd

/home/nzubeifechukwu/data-science-projects/russia-real-estate

In [32]:
series.to_csv('./Downloads/datasets/russia/russia-real-estate-dataset-clean.csv', index=False)

In [6]:
df = pd.read_csv('datasets/russia-real-estate-dataset-clean.csv')

In [7]:
df.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id
0,2021-01-01,2451300,15,31,1,30.3,0.0,56.780112,60.699355,0,2,620000.0,NaN,66,1632918.0
1,2021-01-01,1450000,5,5,1,33.0,6.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN
2,2021-01-01,10700000,4,13,3,85.0,12.0,55.540060,37.725112,3,0,142701.0,242543.0,50,681306.0
3,2021-01-01,3100000,3,5,3,82.0,9.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN
4,2021-01-01,2500000,2,3,1,30.0,9.0,44.738685,37.713668,3,2,353960.0,439378.0,23,1730985.0

In [7]:
russia_region_ids = {
    1: 'Adygea',
    2: 'Bashkortostan',
    3: 'Buryatia',
    4: 'Altai',
    5: 'Dagestan',
    6: 'Ingushetia',
    7: 'Kabardino-Balkar',
    8: 'Kalmykia',
    9: 'Karachay-Cherkess',
    10: 'Karelia',
    11: 'Komi',
    12: 'Mari El',
    13: 'Mordovia',
    14: 'Sakha',
    15: 'North Ossetia–Alania',
    16: 'Tatarstan',
    17: 'Tuva',
    18: 'Udmurt',
    19: 'Khakassia',
    20: 'Chechnya',  # Chechnya same as Chechen Republic. Chose 20 because df[df['id_region'] == 95] yielded nothing
    21: 'Chuvash',
    22: 'Altai',
    23: 'Krasnodar',  # Chose 23 because df[df['id_region'] == 93] yielded nothing
    24: 'Krasnoyarsk',
    25: 'Primorsky',
    26: 'Stavropol',
    27: 'Khabarovsk',
    28: 'Amur',
    29: 'Arkhangelsk',
    30: 'Astrakhan',
    31: 'Belgorod',
    32: 'Bryansk',
    33: 'Vladimir',
    34: 'Volgograd',
    35: 'Vologda',
    36: 'Voronezh',
    37: 'Ivanovo',
    38: 'Irkutsk',
    39: 'Kaliningrad',
    40: 'Kaluga',
    41: 'Kamchatka',
    42: 'Kemerovo',
    43: 'Kirov',
    44: 'Kostroma',
    45: 'Kurgan',
    46: 'Kursk',
    47: 'Leningrad',
    48: 'Lipetsk',
    49: 'Magadan',
    50: 'Moscow Oblast',
    51: 'Murmansk',
    52: 'Nizhny Novgorod',
    53: 'Novgorod',
    54: 'Novosibirsk',
    55: 'Omsk',
    56: 'Orenburg',
    57: 'Oryol',
    58: 'Penza',
    59: 'Perm',
    60: 'Pskov',
    61: 'Rostov',
    62: 'Ryazan',
    63: 'Samara',
    64: 'Saratov',
    65: 'Sakhalin',
    66: 'Sverdlovsk',
    67: 'Smolensk',
    68: 'Tambov',
    69: 'Tver',
    70: 'Tomsk',
    71: 'Tula',
    72: 'Tyumen',
    73: 'Ulyanovsk',
    74: 'Chelyabinsk',
    75: 'Zabaykalsky',
    76: 'Yaroslavl',
    77: 'Moscow',
    78: 'St. Petersburg',
    79: 'Jewish',
    83: 'Nenets',
    86: 'Khanty-Mansi',
    87: 'Chukotka',
    89: 'Yamalo-Nenets',
    91: 'Kaliningrad',
    92: 'Sevastopol'
}

In [10]:
df['region'] = df['id_region'].replace(russia_region_ids)

In [11]:
df.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id,region
0,2021-01-01,2451300,15,31,1,30.3,0.0,56.780112,60.699355,0,2,620000.0,NaN,66,1632918.0,Sverdlovsk
1,2021-01-01,1450000,5,5,1,33.0,6.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN,Adygea
2,2021-01-01,10700000,4,13,3,85.0,12.0,55.540060,37.725112,3,0,142701.0,242543.0,50,681306.0,Moscow Oblast
3,2021-01-01,3100000,3,5,3,82.0,9.0,44.608154,40.138381,0,0,385000.0,NaN,1,NaN,Adygea
4,2021-01-01,2500000,2,3,1,30.0,9.0,44.738685,37.713668,3,2,353960.0,439378.0,23,1730985.0,Krasnodar

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11358150 entries, 0 to 11358149
Data columns (total 16 columns):
date             object
price            int64
level            int64
levels           int64
rooms            int64
area             float64
kitchen_area     float64
geo_lat          float64
geo_lon          float64
building_type    int64
object_type      int64
postal_code      float64
street_id        float64
id_region        int64
house_id         float64
region           object
dtypes: float64(7), int64(7), object(2)
memory usage: 1.4+ GB

In [14]:
df['region'].value_counts()

Moscow                  1032600
Tyumen                   865423
Krasnodar                846948
St. Petersburg           765872
Moscow Oblast            754267
Novosibirsk              607520
Krasnoyarsk              432407
Sverdlovsk               430999
Rostov                   409162
Chelyabinsk              329235
Tatarstan                248297
Kaliningrad              241621
Leningrad                224688
Bashkortostan            220851
Perm                     182089
Voronezh                 182047
Saratov                  169795
Samara                   163197
Nizhny Novgorod          156398
Stavropol                149243
Kemerovo                 141684
Irkutsk                  120327
Volgograd                113249
Kaluga                   111830
Altai                    107029
Belgorod                 107018
Vladimir                 105926
Omsk                     103637
Khanty-Mansi             100836
Penza                     99352
                         ...
Zabaykalsky               36619
Kursk                     35554
Mari El                   32592
Oryol                     31796
Kurgan                    31654
Astrakhan                 31478
Kabardino-Balkar          26718
Tambov                    24463
Sevastopol                22648
North Ossetia–Alania      22617
Novgorod                  21893
Adygea                    20870
Mordovia                  19363
Murmansk                  17433
Karelia                   15719
Pskov                     13673
Primorsky                 13312
Chechnya                  10096
Kamchatka                  9866
Sakhalin                   7918
Yamalo-Nenets              5235
Karachay-Cherkess          4725
Tuva                       3593
200                        3577
Magadan                    3055
Kalmykia                   2498
Ingushetia                 1195
Chukotka                    147
Jewish                       55
Nenets                       48
Name: region, Length: 84, dtype: int64

In [23]:
df = df[df['region'].apply(lambda x: isinstance(x, str))] # drop all numeric values in "region" column

In [29]:
building_type_dict = {
    0: "Don't know",
    1: "Other",
    2: "Panel",
    3: "Monolithic",
    4: "Brick",
    5: "Block",
    6: "Wooden"
}
df['building_type'] = df['building_type'].replace(building_type_dict)

In [30]:
df.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id,region
0,2021-01-01,2451300,15,31,1,30.3,0.0,56.780112,60.699355,Don't know,2,620000.0,NaN,66,1632918.0,Sverdlovsk
1,2021-01-01,1450000,5,5,1,33.0,6.0,44.608154,40.138381,Don't know,0,385000.0,NaN,1,NaN,Adygea
2,2021-01-01,10700000,4,13,3,85.0,12.0,55.540060,37.725112,Monolithic,0,142701.0,242543.0,50,681306.0,Moscow Oblast
3,2021-01-01,3100000,3,5,3,82.0,9.0,44.608154,40.138381,Don't know,0,385000.0,NaN,1,NaN,Adygea
4,2021-01-01,2500000,2,3,1,30.0,9.0,44.738685,37.713668,Monolithic,2,353960.0,439378.0,23,1730985.0,Krasnodar

In [32]:
df['object_type'].value_counts()

0    8358897
2    2995676
Name: object_type, dtype: int64

In [33]:
object_type_dict = {
    0: 'Secondary real estate market',
    2: 'New building'
}

In [34]:
# Predict price for only New building (object type column; not sure what
# 'secondary real estate market means' [I guess it's older buildings but not so sure]).
# Conclude by suggesting that future analysts can combine both types

In [35]:
df['object_type'] = df['object_type'].replace(object_type_dict)

In [36]:
df.head()

,date,price,level,levels,rooms,area,kitchen_area,geo_lat,geo_lon,building_type,object_type,postal_code,street_id,id_region,house_id,region
0,2021-01-01,2451300,15,31,1,30.3,0.0,56.780112,60.699355,Don't know,New building,620000.0,NaN,66,1632918.0,Sverdlovsk
1,2021-01-01,1450000,5,5,1,33.0,6.0,44.608154,40.138381,Don't know,Secondary real estate market,385000.0,NaN,1,NaN,Adygea
2,2021-01-01,10700000,4,13,3,85.0,12.0,55.540060,37.725112,Monolithic,Secondary real estate market,142701.0,242543.0,50,681306.0,Moscow Oblast
3,2021-01-01,3100000,3,5,3,82.0,9.0,44.608154,40.138381,Don't know,Secondary real estate market,385000.0,NaN,1,NaN,Adygea
4,2021-01-01,2500000,2,3,1,30.0,9.0,44.738685,37.713668,Monolithic,New building,353960.0,439378.0,23,1730985.0,Krasnodar